import 'package:egyption_food/model/constanent.dart';

var meals = [
  Meals(
      title: 'الطعمیة المصریة الأصلیة',
      id: 'c1',
      image: 'assets/c1.png',
      description:
          ''' توضع المكونات السابقة في مدق أو مفرمة خشنة، ولیس الكبة حتى تخرج
خشنة الملمس نوعا ما ولیست ناعمة
للغایة ثم توضع علیها قلیل من كربونات الصودیوم لتعطي إنتفاخا للقرص.
تشكل الطعمیة على هیئة أقراص. ویزین الوجه بالسمسم وتقلى في الزیت
المسخن مسبقا
''',
      ingredients: '''- كیلو فول مدشوش منقوع 4 ساعات في ماء فاتر - بصلتین - رأس
ثوم - 4 حزم من الكرات - ملح وفلفل - سمسم للتزیین
'''),
  Meals(
      title: 'الفول المدمس',
      id: 'c2',
      image: 'assets/c2.png',
      description:
          '''1 .یفرغ الفول في إناء الطهو ثم نقوم بتقطیع الطماطم والفلفل إلى قطع
صغیرة علیه.
2 .نضیف القلیل من الماء والزیت حسب الرغبة.
3 .نقطع سن الثوم إلى نصفین ونضفیهم ونضع الخل والملح والشطة
وملعقة الطحینة ونقوم بتقلیب جمیع المحتویات على نار هادئة من 5 إلى
10 دقائق.
الآن الیك طرق تحضیر أشهر تلك الأطباق الشعبیة وتمتاز بسهولة إعدادها
وخفتها على المعدة''',
      ingredients: ''' كمیة فول مدمس تكفي لأربع أفراد
1 طماطم كبیرة
1 فلفل رومي كبیرة
2 ملعقة طعام طحینة
ربع ملعقة صغیرة شطة
ملعقة صغیرة ملح
ملعقة صغیرة خل
1 سن ثوم
زیت حسب الرغبة
قلیل من الماء
'''),
  Meals(
      title: 'شوربة العدس',
      id: 'c3',
      image: 'assets/c3.png',
      description: ''' - ینظف العدس ویغسل جیدا
- یتم تقطیع البطاطس والجزر والطماطم إلى مكعبات بعد تقشیرها.
- یوضع العدس في وعاء على النار مع الماء أو البهریز، ثم یضاف
البصل والبطاطس والثوم والجزر. ویترك حتى یتم النضج. مع ملاحظة
استمرار تقلیبه أثناء وجوده على النار.
- بعد أن یبرد الخلیط یضاف الیه الملح والفلفل الاسود والكمون ویخلط
في الخلاط الكهربائي ثم یصفى.
- توضع شوربة العدس مرة أخرى على النار مع التحكم في سمك القوام
المطلوب حسب الرغبة.
- توضع الزبد في طاسة على نار هادئة ویضاف لها قلیل من الثوم
المفري ویقلب حتى یصفر لونه ثم یوضع على الشوربة وتقدم ساخنة''',
      ingredients: '''- كوب عدس أحمر مجروش. - 4 أكواب ماء أو بهریز (خلاصة
الشوربة). - حبة واحدة من البطاطس، الجزر، الطماطم. - ثوم، بصلة
مقطعة.
- ملح وفلفل كمون. - ملعقتا زبدة.
.
 '''),
  Meals(
      title: 'المسقعة على الطریقة المصریة',
      id: 'c4',
      image: 'assets/c4.png',
      description:
          '''- یحمر الثوم المفري في الزیت حتى یصفر لونه. ثم نضیف الیه الخل
ثم صلصة الطماطم المذابة في نحو كوب من الماء، والشطة الحمراء
والفلفل الاسود والملح.
- غطي الإناء وهدئي النار وأتركي الخلیط حتى یغلظ قوامه ویطفو الزیت
على سطح الصلصة.
- أضیفى الباذنجان والفلفل. واتركیهما على النار حتى یختلط المقدار
ببعضه ثم أرفعي الاناء من على النار واتركیه حتى یبرد ویقدم مع
البطاطس المحمرة ''',
      ingredients: ''' - كمیة من الباذنجان والفلفل الأخضر یتم تحمیرهما في الزیت.
- ملعقتان كبیرتان من صلصة الطماطم.
- ملعقة صغیرة ثوم مفري.
- ملح، فلفل، وقلیل من الشطة الحمراء المطحونة.
- ملعقة متوسطة زیت. - ملعقة متوسطة خل أبیض'''),
  Meals(
      title: 'الكشك',
      id: 'c5',
      image: 'assets/c5.png',
      description: '''- یرفع الخلیط على النار حتى یغلي ویغلظ قوامه.
- یضاف الیه الملح والفلفل والسمن المتبقي من تحمیر البصل. ثم یصب
ً مع الخبز
الكشك في طبق التقدیم. ویزین بالبصل المحمر. ویقدم ساخنا
المحمص''',
      ingredients: '''- ملعقتان كبیرتان من الدقیق.
- ملعقة كبیرة حلیب بودرة.
- ملعقتان متوسطتان من أرز الناضج.
- كوب شوربة. - ملعقة كبیرة سمن.
- ملح - فلفل '''),
  Meals(
      title: 'الكشرى المصرى',
      id: 'c6',
      image: 'assets/c6.png',
      description: '''تخلط حلقات البصل بقلیل من الدقیق ثم تحمر فى الزیت
وتصفى وترفع على ورق ماص
یوخذ الزیت المتخلف من تحمیر البصل ویؤخذ منه جزء ویحمر
فیها قلیل من الشعریه ثم نضیف الارز ونسقیه بالمرق ونتركه لینضج
نسلق المكرونه ونصفیها من الماء ونضع علیها ملعه زیت
من زیت البصل مع نصف ملعقه من الفلفل الحار المطحون
نسلق العدس فى الماء المضاف الیه القلیل من الثوم المدقوق
ویمكن ان نسلق حمص شامى ایضا لعمل الصلصه
ناخود مقدار من الزیت المتخلف من تحمیر البصل ونحمر
فیه الثوم ونضیف معه التوابل الفلفل الاسود والكمون والبهارات
والفلفل الحلو ملعقه كبیرهثم نضع صلصه الطماطم ونتركها لتتسبك
لعمل صلصه الخل نحمر قلیل من الثوم ونضع معه كزبره ناشفه
والقلیل من الخل
طریقه التقدیم نضع المكرونه ثم الارز والعدس والحمص ثم
صلصه الطماطم وحلقات البصل المقرمشه''',
      ingredients: '''مكرونه صغیره مسلوقه
ارز ابیض
شعریه
حلقات بصل
ملعقه دقیق
صلصه صماطم
عدس بجبه او اصفر
ثوم
زیت '''),
  Meals(
      title: 'مسقعـــــه شعبیه',
      id: 'c7',
      image: 'assets/c4.png',
      description: ''' حمرى البصل فى الزیت اللى ان یصفر لونه ضعى الثوم المدقوق
قلبى جیدا ضیفى الفلفل الاحمر الحلو والفل الاسود والكزبره
وقلیل من القرفه
ثم ضیفى عصیر الطماطم غطى القدر وهدئى النار واتركیها
لتتسبك جیدا الى ان یظهر الزیت على وش الصلصه ثم ضیفى
الباذنجان والفلفل والبطاطس وباقى التوابل البهارات والكمون
وزودى المرق حسب الحاجه...
قدمیها مع الارز او مع الخبز''',
      ingredients: '''1 -باذنجان وفلفل وبطاطس مقلیین..
2 -صلصه طماطم..
3 -ثوم مدقوق...
4 -بصله مبشوره..
5 -كوب مرق او ماء..
6 -التوابل( ملح فلفل كمون كزبره قرفه فلفل احمر حلو بهارات)
7 -زیت او سمن.'''),
  Meals(
      title: 'ارز معمر بالحمام المحشي',
      id: 'c8',
      image: 'assets/c8.png',
      description: '''لعمل الارز المعمر بالحمام تتبلي الحمام بالفلفل و الملح.
اقسمي كل واحدة من الحمام إلى نصفین وحمیها في السمن.
اغسلي الأرز واتركیه بالماء لمدة 10 دقائق ثم صفیه من الماء
جیدا، وتبلیه .
ضعي طبقة بسیطة جدا من الأرز بقاع صینیة بایركس وممكن أى
صینیة فرن.
ضعي الحمام المحمر .
ضعي طبقة أخرى من الأرز فوق الحمام
اغلي اللبن وأضیفي إلیه الملح ، ثم أضیفي له السمن.
ثم أضیفیه فوق الأرز و الحمام، وضعي القشطة على الوجه .
أدخلي الارز المعمر بالحمام الفرن حتى ینضج
قدمى الارز المعمر بالحمام وبالهنا واالشف ''',
      ingredients: '''لكل كوب أرز كوب سائل مكون من
لبن (حلیب )
شوربه أو ماء
وملعقة سمن
قشطة
ملح
فلفل أسود حسب الرغبة'''),
  Meals(
      title: 'البصارة طبق نباتي من الأكلات المصریة',
      id: 'c9', image: 'assets/c9.png', description: '''ینظف الفول و یضاف كمیة من الماء كافیة لسلقه , تضاف الكزبرة
الخضراء و النعناع الجاف و البصلة و الثوم , یجب عدم وضع اى
ملعقة اثناء تسویة الخلیط لكى ینضج الفول و ندعه حتى یستوي
تماماً .
ً بعد تمام النضج , ندع المزیج یبرد قلیلا ثم یخلط بالخلاط .
یعاد الخلیط للنار قلیلا و یتبل بالملح و الفلفل حسب الذوق .
تتم عمل التقلیة بالثوم و الكزبرة الجافة المدقوقین جیدا و یحمر فى
القلیل من الزیت و السمن ثم یزین بها وجه الطبق و تقدم ''', ingredients: '''ربع كیلو فول جاف بدون قشره
ربطتین كزبرة خضراء
بصلة متوسطة
عدد من فصوص الثوم حسب الرغبة
قلیل من النعناع الجاف
ملح و فلفل حسب الذوق
– للتقلیة عدد من فصوص الثوم مع كزبرة جافة''')
];
